gauthig/firefly-touch/sdkconfig.defaults
# ESP32-S3-WROOM-1-N16R8 (16 MB quad flash, 8 MB octal PSRAM)
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# Dual-OTA partition layout (see partitions.csv). Reserved now so a future
# Wi-Fi OTA update path needs no repartitioning of installed panels.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Roll back automatically if an OTA image fails to reach a healthy state.
# Requires the app to call esp_ota_mark_app_valid_cancel_rollback() once it is
# up — main.c does this at the end of app_main. Panels live inside walls; a
# bad OTA must not require pulling one out.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# Octal PSRAM @ 80 MHz; keep flash/rodata fetch from PSRAM to reduce RGB LCD
# underrun/flicker (per Espressif RGB-panel app note / Waveshare demo).
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y

# RGB LCD driver
CONFIG_LCD_RGB_ISR_IRAM_SAFE=y
CONFIG_LCD_RGB_RESTART_IN_VSYNC=n

# TWAI
CONFIG_TWAI_ISR_IN_IRAM=y

CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# LVGL 9
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_28=y
